# Saturation Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RenderingImageExposureSettings..::..Saturation Property
RenderingImageExposureSettings Class See Also
---
The value of rendering image saturation.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public double Saturation { get; set; }
```

Visual Basic
---
```text
Public Property Saturation As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double Saturation {
	double get ();
	void set (double value);
}
```

# Remarks
Increase this value to get more intense colors.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: The value of saturation is not valid. The valid range is 0 to 5. |

# See Also
RenderingImageExposureSettings Class
Autodesk.Revit.DB Namespace